src/BusinessProcesses/ТестированиеКандидатов/ТестированиеКандидатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ТестированиеКандидатов</name>
  <task>Task.ЗадачаТестированиеКандидатов</task>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Возраст</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПройденТестАдминистрирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПройдетТестПрограммирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредложеннаяВакансия</name>
    <type>
      <types>EnumRef.Вакансии</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

src/Enums/Вакансии/Вакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Вакансии</name>
  <enumValues>
    <name>Оператор</name>
  </enumValues>
  <enumValues>
    <name>Администратор</name>
  </enumValues>
  <enumValues>
    <name>Программист</name>
  </enumValues>
</mdclass:Enum>

src/BusinessProcesses/ТестированиеКандидатов/ObjectModule.bsl
Процедура УсловиеПроверкаУсловия(ТочкаМаршрута, Результат)
	Результат = ПройденТестАдминистрирования;
КонецПроцедуры

Процедура ПрошелТестНаПрограммированиеПроверкаУсловия(ТочкаМаршрута, Результат)
	Результат = ПройденТестАдминистрирования;
КонецПроцедуры

Процедура Действие1ПриВыполнении(ТочкаМаршрута, Задача, Отказ)
	ПредложеннаяВакансия = Перечисления.Вакансии.Оператор;
КонецПроцедуры

Процедура Действие2ПриВыполнении(ТочкаМаршрута, Задача, Отказ)
	ПредложеннаяВакансия = Перечисления.Вакансии.Администратор;
КонецПроцедуры

Процедура Действие3ПриВыполнении(ТочкаМаршрута, Задача, Отказ)
	ПредложеннаяВакансия = Перечисления.Вакансии.Программист;
КонецПроцедуры
